## Production: alert_compromise
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                      NAME                       |
|--------|-------------------------------------------------|
| add    | `aws_iam_role_policy.ssm_get_parameters_policy` |
|        | `aws_ssm_parameter.notify_test_api_key`         |
| update | `aws_lambda_function.broadcast_alert`           |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_iam_role_policy.ssm_get_parameters_policy will be created
  + resource "aws_iam_role_policy" "ssm_get_parameters_policy" {
      + id     = (known after apply)
      + name   = "ssm_get_parameters_policy"
      + policy = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssm:GetParameters",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ca-central-1:283582579564:parameter/notify_test_api_key"
                      + Sid      = "AllowSSMGetParameters"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role   = "group_broadcast_alert_role"
    }

  # aws_lambda_function.broadcast_alert will be updated in-place
  ~ resource "aws_lambda_function" "broadcast_alert" {
      + code_signing_config_arn        = ""
        id                             = "broadcast_alert"
      + image_uri                      = ""
      + kms_key_arn                    = ""
      ~ last_modified                  = "2024-02-07T16:46:57.000+0000" -> (known after apply)
      + signing_job_arn                = ""
      + signing_profile_version_arn    = ""
      ~ source_code_hash               = "iMdjrwRSRdaAHQb53diaNvdtrNz9LmteQW1Ame+Y6AQ=" -> "LO8ePvvRq35GdapwfgLvIpNn2wc0TnVLDhj1lx+JSRQ="
        tags                           = {}
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "notify_test_api_key" = (sensitive value)
                # (2 unchanged elements hidden)
            }
        }

        # (2 unchanged blocks hidden)
    }

  # aws_ssm_parameter.notify_test_api_key will be created
  + resource "aws_ssm_parameter" "notify_test_api_key" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "notify_test_api_key"
      + tags           = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "github-secret-scanning-production"
          + "Terraform"  = "true"
        }
      + tier           = (known after apply)
      + type           = "SecureString"
      + value          = (sensitive value)
      + version        = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.group_broadcast_alert_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_lambda_function.broadcast_alert"]

21 tests, 19 passed, 2 warnings, 0 failures, 0 exceptions

```

</details>
